# -*- coding: utf-8 -*-
"""
Задание 4.2

Преобразовать строку mac из формата XXXX:XXXX:XXXX в формат XXXX.XXXX.XXXX

Ограничение: Все задания надо выполнять используя только пройденные темы.

"""

mac = "AAAA:BBBB:CCCC"

Для выполнения данного задания я использую метод Replace()
Метод позволяет осуществить замену последовательности символов в строке на другую последовательность
После применения метода Replace() присваиваю новое значение переменной.

Ответ:
  
  string1 = 'mac = "AAAA:BBBB:CCCC"'
  string1.replace(':', '.')
  string1 =  string1.replace(':', '.')
